Revit 2024 API
RebarCurvesData.SetDistributionPath Method
 Sets a new distribution path to be applied to the rebar. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public void SetDistributionPath(
	IList<Curve> path
)
Visual Basic
Public Sub SetDistributionPath ( _
	path As IList(Of Curve) _
)
Visual C++
public:
void SetDistributionPath(
	IList<Curve^>^ path
)
Parameters
path
Type: System.Collections.Generic.IList<Curve>
 Input curves that describe the new path.
Remarks
 For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars. The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace